#include "KiIR_RCA.h"

const Protocol RCA_ProtocolInfo =
{
	peRCA, "RCA",								// Идентификатор и название протокола
	ptPulseDistance,							// Тип протокола
	{ { 0, 24, 24, 150000 } }, bdMSB,			// Количество бит, Кол-во бит для тестового фрейма, Количество фреймов, Начало LSB или MSB
	{ 0, bcMARK, { 500, 1000 /* 1500 - 500 */ } },	// Описание бита "0"
	{ 1, bcMARK, { 500, 2000 /* 2500 - 500 */ } },	// Описание бита "1"
	true, { 1, bcMARK, { 4000, 4000 } },		// Наличие битов для Lead, Описание Lead
	false, { 0, bcMARK, { 0, 0 } },				// Наличие битов для Repeat Lead, Описание Repeat Lead
	true, { rtNormal, ritPeriod, 64000 },		// Повтор (всё о повторе)
	true, { 0, bcMARK, { 500, 1000 /* 1500 - 500 */ } }	// Финальный бит
};
